export const BIRD_WIDTH = 42
export const BIRD_HEIGHT = 34
export const PIPE_WIDTH = 52
export const PIPE_HEIGHT = 562
export const GROUND_HEIGHT = 150

export const ANIMATION_DURATION = 3000
export const COPTER_ANIMATION_DURATION = 2500

export const GRAVITY = 800
export const VELOCITY_ON_TAP = -400
export const PIPE_LEFT_EDGE = -100
export const COPTER_LEFT_EDGE = -150

export const PIPE_START_RANGE = -220
export const PIPE_END_RANGE = 200

export const SCORE_GRADIENT_VIBRANT = ['#ffffff', '#fffa50']
export const SCORE_GRADIENT_COOL = ['#ffffff', '#b2dffc']
export const OVERLAY_COLOR = '#000000ad'

export const COUNTDOWN_WIDTH = 24
export const COUNTDOWN_HEIGHT = 36

export const SCORE_Y = 150
export const SCORE_BOX_WIDTH = 64
export const SCORE_BOX_COLOR = '#00000036'
export const SCORE_BOX_RADIUS = 8

export const GIFT_SCORE_X = 8
export const GIFT_SCORE_Y = 5
export const GIFT_SCORE_WIDTH = 100
export const GIFT_SCORE_HEIGHT = 40

export const SPEER_WIDTH = 70
export const COPTER_HEIGHT = 48
export const COPTER_WIDTH = 150

//TODO Check difficulty steps range
export const APPEAR_GIFT_STEPS = [3, 8, 17, 21, 25]
export const GIFT_WISHES = [
  {
    title: 'Легко не будет! 💪',
    description:
      'Сопротивление будет всегда. Еще в школе учили, что на каждое действие есть противодействие. Всегда будет сопротивление. Чтобы ты не делала, что бы ты не не делала, эта сила будет всегда.\n\n Иногда будет больше, чем активное усилие, и ты будешь откатываться назад, а иногда - наоборот, и будет казаться, что ты снова идешь дальше. Прямолинейности не будет никогда, и с этим нужно смириться в те моменты, когда кажется, что твой мир внешний и внутренний рушится, когдаьтебе грустно, когда приходит недуг, болезнь. Исключительно в эти моменты ты можешь показать себя, а не тогда, когда все идет как ты хочешь. Только в фазе спада ты можешь проявить настоящую силу и устойчивость.\n\nЯ желаю тебе в моменты повышенного внутреннего или внешнего сопротивления сил и с уверенностью пройти все испытания для тебя приготовленные. Не сворачивая с того пути, которого ты придерживаешься, делая то, что должно быть сделано. И в конце концов обязательно что-то получится. Любое, хоть малейшее усилие при его повторении обязательно куда-то приведет, и результат будет обязательно!'
  },
  {
    title: 'Благодарность - это ключ 🌟',
    description:
      'Не забывай, не игнорируй все хорошее, все те прекрасные моменты, которые происходили и происходят с тобой.\n\nНе забывай о себе, что ты именно такая. С острым умом, образованная, с внешним видом. За свою семью, за близких людей, которые тебя окружают, за то здоровье и внутренний характер, который в тебе есть.\n\nНе слишком теряйся в прошлом и будущем, все свмое интересное и красивое происходит сейчас, именно в ту секунду, в которую ты это читаешь. Именно в эту секунду ты идеальна, и у тебя есть все, не раньше, не позже. Цени настойщий момент, в котором все происходит, ведь к сожалению, особенно сейчас, во время военных действий он может резко прерваться.\n\nБудь благорадна. У тебя есть все ресурсы и сылы, близкие тебе люди, чтобы реализовать себя, свой внутненний талант, свои исключительные, особенные способности!'
  },
  {
    title: 'Что по поводу любви?  ❤️',
    description:
      'Что без сомнений сразу можно пожелать - так это абсолютной любви! Я не говорю сейчас про М + Ж любовь, там можно обсуждать бесконечно...\n\nВ первую очередь я имею ввиду любовь в формате Мать + Дочь, Отец + Сын, Брат + Сестра, к родителям, к лучшему другу. Про эту любовь. Вот она на самом деле достойна, и может очень многое. Давать тебе невидомые силы, которых ты никогда не чувтсвовала. Она абсолютна, бескорыстна. Она полностью принимает все твои недостатки, особенности, чтобы ты не сделала, где бы ты не ошиблась, эта любовь будет всегда, без потребностей. Тебя всегда поддержат, как и ты в свою очередь, и будут с тобой до конца! На эту тему можно говорить долго, но не хватит высоты экрана...\n\nВот такой любви я тебе искренне без сомнений хочу пожелать. Чтобы она с тобой была всегда, ночью и днем, в радости и горе!'
  },
  {
    title: 'Будь собой 🌞',
    description:
      'Ты - идеальна, неповторима в эту секунду, такая как ты есть!\n\nТы уникальна в своем роде, и такой как ты никогда здесь не было и никогда больше не будет, как и каждого из нас. Не забывай об этом, когда в стедующий раз будешь корить себя за что-то (если коришь), угнетать себя за то, что что-то у тебя не выходит или не получается (если угнетаешь), злиться та себя за что-то (если злишься).\n\nТы гениальна по-своему. Есть ли у тебя работа, должнось, дениги или еще что-то или ничего из этого нет, ты всегда будешь оставаться неповторимой. Со своими достоинствами, со своими недостатками (если они есть 😊)\n\nВ каждом есть талант. Я желаю его тебе раскрыть полностью, при этом не копируя других, раскрываться, оставаясь собой, именно такой какой ты есть. Любви  к себе, уважения за то, что ты именно такая.'
  },
  {
    title: 'Все буде добре! 👍',
    description:
      'Ну что же. Так как ты дошла до этого этапа, значит желать тебе настойчивости и целеустремленности смысла нет, так как эти качества значит у тебя уже есть, и мне не нужно еще тут языком лялякать про настойчивость и т.д. 😉\n\nЖелать тебе всего хорошего тоже смысла нет, потому что пожелаешь этого или нет, все равно у тебя и так будет все хорошо в конце концов. \n\nВещи могут казаться страшными, ужасными, веселыми, радостными, всякими разными, но все равно все развернется как должно будет, просто сейчас этого может быть не видно. Все встанет на свои места. Всему свое время, замедлить или ускорить ничего нельзя.\n\nТак что просто оставайся собой, делай то, чего не можешь не сделать, поступай и живи так, как считаешь нужным, люби, будь любимой, будь благодарна тому, какой ты есть на самом деле, люби себя, будь смелой, будь среди близких тебе людей, и все будет хорошо.\n\nСпасибо за внимание.\nС Днем Рождения! 🎉'
  }
]

export const TARGET_USER_ID = '663b0b0a3399a6bf829fdf66'
export const EMAIL_REGEX = /^[^\s@]+@[^\s@]+\.[^\s@]+$/
